; ModuleID = 'buzz_lb_kern.c'
source_filename = "buzz_lb_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [20 x i32]*, i32*, i64*, [128 x i32]* }
%struct.anon.4 = type { [20 x i32]*, i32*, i64*, [128 x i32]* }
%struct.anon.5 = type { [2 x i32]*, i32*, i32*, [1 x i32]* }
%struct.anon.6 = type { [2 x i32]*, i32*, i32*, [1 x i32]* }
%struct.sk_reuseport_md = type { %union.anon, %union.anon.0, i32, i32, i32, i32, i32, %union.anon.1, %union.anon.2 }
%union.anon = type { i8* }
%union.anon.0 = type { i8* }
%union.anon.1 = type { %struct.bpf_sock* }
%struct.bpf_sock = type { i32, i32, i32, i32, i32, i32, i32, [4 x i32], i32, i16, i32, [4 x i32], i32, i32 }
%union.anon.2 = type { %struct.bpf_sock* }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon.3 }
%union.anon.3 = type { [4 x i32] }

@zero = dso_local constant i32 0, align 4, !dbg !0
@balancer_max = dso_local constant i32 128, align 4, !dbg !31
@tcp_balancing_targets = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !64
@udp_balancing_targets = dso_local global %struct.anon.4 zeroinitializer, section ".maps", align 8, !dbg !84
@size = dso_local global %struct.anon.5 zeroinitializer, section ".maps", align 8, !dbg !56

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "zero", scope: !2, file: !3, line: 26, type: !33, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !30, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "buzz_lb_kern.c", directory: "/media/aadhitya/DATA/XCodes/buzzLB/src", checksumkind: CSK_MD5, checksum: "0ce1b0bd390ef570fe78603adaa5b0d0")
!4 = !{!5, !11, !15}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sk_action", file: !6, line: 43317, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./vmlinux.h", directory: "/media/aadhitya/DATA/XCodes/buzzLB/src", checksumkind: CSK_MD5, checksum: "11eb692ee35903a9cd527ec4f7485b7b")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "SK_DROP", value: 0)
!10 = !DIEnumerator(name: "SK_PASS", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bpf_hdr_start_off", file: !6, line: 122169, baseType: !7, size: 32, elements: !12)
!12 = !{!13, !14}
!13 = !DIEnumerator(name: "BPF_HDR_START_MAC", value: 0)
!14 = !DIEnumerator(name: "BPF_HDR_START_NET", value: 1)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 43553, baseType: !7, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "BPF_ANY", value: 0)
!18 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!19 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!20 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!21 = !{!22, !24, !26}
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !6, line: 10, baseType: !23)
!23 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !6, line: 409, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !6, line: 12, baseType: !7)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, elements: !28)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !6, line: 7174, baseType: !25)
!28 = !{!29}
!29 = !DISubrange(count: 4)
!30 = !{!0, !31, !34, !38, !56, !64, !84, !92, !102, !107, !112, !117}
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "balancer_max", scope: !2, file: !3, line: 27, type: !33, isLocal: false, isDefinition: true)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 187, type: !36, isLocal: false, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 32, elements: !28)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "nonce", scope: !2, file: !3, line: 36, type: !40, isLocal: false, isDefinition: true)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 31, size: 256, elements: !41)
!41 = !{!42, !48, !50, !51}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !3, line: 32, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 64, elements: !46)
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !{!47}
!47 = !DISubrange(count: 2)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !40, file: !3, line: 33, baseType: !49, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !40, file: !3, line: 34, baseType: !49, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !40, file: !3, line: 35, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 32, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 1)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "size", scope: !2, file: !3, line: 43, type: !58, isLocal: false, isDefinition: true)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 38, size: 256, elements: !59)
!59 = !{!60, !61, !62, !63}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !58, file: !3, line: 39, baseType: !43, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !58, file: !3, line: 40, baseType: !49, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !58, file: !3, line: 41, baseType: !49, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !58, file: !3, line: 42, baseType: !52, size: 64, offset: 192)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "tcp_balancing_targets", scope: !2, file: !3, line: 50, type: !66, isLocal: false, isDefinition: true)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 45, size: 256, elements: !67)
!67 = !{!68, !73, !74, !79}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !3, line: 46, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 640, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 20)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !66, file: !3, line: 47, baseType: !49, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !66, file: !3, line: 48, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !6, line: 18, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !6, line: 16, baseType: !78)
!78 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !66, file: !3, line: 49, baseType: !80, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 4096, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 128)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "udp_balancing_targets", scope: !2, file: !3, line: 57, type: !86, isLocal: false, isDefinition: true)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 52, size: 256, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !86, file: !3, line: 53, baseType: !69, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !86, file: !3, line: 54, baseType: !49, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !86, file: !3, line: 55, baseType: !75, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !86, file: !3, line: 56, baseType: !80, size: 64, offset: 192)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "bpf_skb_load_bytes_relative", scope: !2, file: !94, line: 1813, type: !95, isLocal: true, isDefinition: true)
!94 = !DIFile(filename: "./../libbpf/src/bpf_helper_defs.h", directory: "/media/aadhitya/DATA/XCodes/buzzLB/src", checksumkind: CSK_MD5, checksum: "2d210aba22162d34a56b8d1dc5e331a2")
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !99, !25, !101, !25, !25}
!98 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !94, line: 56, type: !104, isLocal: true, isDefinition: true)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!101, !101, !99}
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !94, line: 78, type: !109, isLocal: true, isDefinition: true)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!98, !101, !99, !99, !77}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "bpf_get_prandom_u32", scope: !2, file: !94, line: 193, type: !114, isLocal: true, isDefinition: true)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!25}
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "bpf_sk_select_reuseport", scope: !2, file: !94, line: 2148, type: !119, isLocal: true, isDefinition: true)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!98, !122, !101, !101, !77}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_reuseport_md", file: !6, line: 46184, size: 448, elements: !124)
!124 = !{!125, !129, !133, !134, !135, !136, !137, !138, !162}
!125 = !DIDerivedType(tag: DW_TAG_member, scope: !123, file: !6, line: 46185, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !123, file: !6, line: 46185, size: 64, elements: !127)
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !6, line: 46186, baseType: !101, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, scope: !123, file: !6, line: 46188, baseType: !130, size: 64, offset: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !123, file: !6, line: 46188, size: 64, elements: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !130, file: !6, line: 46189, baseType: !101, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !123, file: !6, line: 46191, baseType: !25, size: 32, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "eth_protocol", scope: !123, file: !6, line: 46192, baseType: !25, size: 32, offset: 160)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ip_protocol", scope: !123, file: !6, line: 46193, baseType: !25, size: 32, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "bind_inany", scope: !123, file: !6, line: 46194, baseType: !25, size: 32, offset: 224)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !123, file: !6, line: 46195, baseType: !25, size: 32, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, scope: !123, file: !6, line: 46196, baseType: !139, size: 64, offset: 320)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !123, file: !6, line: 46196, size: 64, elements: !140)
!140 = !{!141}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !139, file: !6, line: 46197, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !6, line: 46097, size: 640, elements: !144)
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !154, !155, !157, !158, !159, !160}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !143, file: !6, line: 46098, baseType: !25, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !143, file: !6, line: 46099, baseType: !25, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !143, file: !6, line: 46100, baseType: !25, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !143, file: !6, line: 46101, baseType: !25, size: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !143, file: !6, line: 46102, baseType: !25, size: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !143, file: !6, line: 46103, baseType: !25, size: 32, offset: 160)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !143, file: !6, line: 46104, baseType: !25, size: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !143, file: !6, line: 46105, baseType: !153, size: 128, offset: 224)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, elements: !28)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !143, file: !6, line: 46106, baseType: !25, size: 32, offset: 352)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !143, file: !6, line: 46107, baseType: !156, size: 16, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !6, line: 7170, baseType: !22)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !143, file: !6, line: 46108, baseType: !25, size: 32, offset: 416)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !143, file: !6, line: 46109, baseType: !153, size: 128, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !143, file: !6, line: 46110, baseType: !25, size: 32, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !143, file: !6, line: 46111, baseType: !161, size: 32, offset: 608)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !6, line: 401, baseType: !45)
!162 = !DIDerivedType(tag: DW_TAG_member, scope: !123, file: !6, line: 46199, baseType: !163, size: 64, offset: 384)
!163 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !123, file: !6, line: 46199, size: 64, elements: !164)
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "migrating_sk", scope: !163, file: !6, line: 46200, baseType: !142, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !6, line: 66181, size: 160, elements: !167)
!167 = !{!168, !171, !172, !173, !174, !175, !176, !177, !178, !180, !181}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !166, file: !6, line: 66182, baseType: !169, size: 4, flags: DIFlagBitField, extraData: i64 0)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !6, line: 8, baseType: !170)
!170 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !166, file: !6, line: 66183, baseType: !169, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !166, file: !6, line: 66184, baseType: !169, size: 8, offset: 8)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !166, file: !6, line: 66185, baseType: !156, size: 16, offset: 16)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !166, file: !6, line: 66186, baseType: !156, size: 16, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !166, file: !6, line: 66187, baseType: !156, size: 16, offset: 48)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !166, file: !6, line: 66188, baseType: !169, size: 8, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !166, file: !6, line: 66189, baseType: !169, size: 8, offset: 72)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !166, file: !6, line: 66190, baseType: !179, size: 16, offset: 80)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !6, line: 65086, baseType: !22)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !166, file: !6, line: 66191, baseType: !27, size: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !166, file: !6, line: 66192, baseType: !27, size: 32, offset: 128)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !6, line: 66207, size: 320, elements: !183)
!183 = !{!184, !185, !186, !190, !191, !192, !193, !208}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !182, file: !6, line: 66208, baseType: !169, size: 4, flags: DIFlagBitField, extraData: i64 0)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !182, file: !6, line: 66209, baseType: !169, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !182, file: !6, line: 66210, baseType: !187, size: 24, offset: 8)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 24, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 3)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !182, file: !6, line: 66211, baseType: !156, size: 16, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !182, file: !6, line: 66212, baseType: !169, size: 8, offset: 48)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !182, file: !6, line: 66213, baseType: !169, size: 8, offset: 56)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !182, file: !6, line: 66214, baseType: !194, size: 128, offset: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !6, line: 9641, size: 128, elements: !195)
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !194, file: !6, line: 9646, baseType: !197, size: 128)
!197 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !194, file: !6, line: 9642, size: 128, elements: !198)
!198 = !{!199, !203, !207}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !197, file: !6, line: 9643, baseType: !200, size: 128)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 128, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 16)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !197, file: !6, line: 9644, baseType: !204, size: 128)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 128, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 8)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !197, file: !6, line: 9645, baseType: !26, size: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !182, file: !6, line: 66215, baseType: !194, size: 128, offset: 192)
!209 = !{i32 7, !"Dwarf Version", i32 5}
!210 = !{i32 2, !"Debug Info Version", i32 3}
!211 = !{i32 1, !"wchar_size", i32 4}
!212 = !{i32 7, !"frame-pointer", i32 2}
!213 = !{!"Ubuntu clang version 14.0.0-1ubuntu1"}
!214 = distinct !DISubprogram(name: "_selector", scope: !3, file: !3, line: 107, type: !215, scopeLine: 107, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !217)
!215 = !DISubroutineType(types: !216)
!216 = !{!5, !122}
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225}
!218 = !DILocalVariable(name: "reuse", arg: 1, scope: !214, file: !3, line: 107, type: !122)
!219 = !DILocalVariable(name: "action", scope: !214, file: !3, line: 108, type: !5)
!220 = !DILocalVariable(name: "ip", scope: !214, file: !3, line: 109, type: !166)
!221 = !DILocalVariable(name: "ipv6", scope: !214, file: !3, line: 110, type: !182)
!222 = !DILocalVariable(name: "key", scope: !214, file: !3, line: 112, type: !24)
!223 = !DILocalVariable(name: "is_ipv4", scope: !214, file: !3, line: 114, type: !45)
!224 = !DILocalVariable(name: "targets", scope: !214, file: !3, line: 115, type: !101)
!225 = !DILocalVariable(name: "balancer_count", scope: !214, file: !3, line: 141, type: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!227 = !DILocation(line: 0, scope: !214)
!228 = !DILocation(line: 109, column: 3, scope: !214)
!229 = !DILocation(line: 109, column: 16, scope: !214)
!230 = !DILocation(line: 110, column: 3, scope: !214)
!231 = !DILocation(line: 110, column: 18, scope: !214)
!232 = !DILocation(line: 112, column: 3, scope: !214)
!233 = !DILocation(line: 114, column: 24, scope: !214)
!234 = !{!235, !238, i64 20}
!235 = !{!"sk_reuseport_md", !236, i64 0, !236, i64 8, !238, i64 16, !238, i64 20, !238, i64 24, !238, i64 28, !238, i64 32, !236, i64 40, !236, i64 48}
!236 = !{!"omnipotent char", !237, i64 0}
!237 = !{!"Simple C/C++ TBAA"}
!238 = !{!"int", !236, i64 0}
!239 = !DILocation(line: 114, column: 37, scope: !214)
!240 = !DILocation(line: 118, column: 3, scope: !214)
!241 = !DILocation(line: 119, column: 3, scope: !214)
!242 = !DILocation(line: 121, column: 18, scope: !214)
!243 = !{!235, !238, i64 24}
!244 = !DILocation(line: 121, column: 3, scope: !214)
!245 = !DILocation(line: 127, column: 7, scope: !246)
!246 = distinct !DILexicalBlock(scope: !214, file: !3, line: 121, column: 31)
!247 = !DILocation(line: 0, scope: !246)
!248 = !DILocation(line: 135, column: 6, scope: !214)
!249 = !DILocation(line: 136, column: 5, scope: !250)
!250 = distinct !DILexicalBlock(scope: !251, file: !3, line: 135, column: 14)
!251 = distinct !DILexicalBlock(scope: !214, file: !3, line: 135, column: 6)
!252 = !DILocation(line: 137, column: 3, scope: !250)
!253 = !DILocation(line: 138, column: 5, scope: !254)
!254 = distinct !DILexicalBlock(scope: !251, file: !3, line: 137, column: 10)
!255 = !DILocation(line: 141, column: 31, scope: !214)
!256 = !DILocation(line: 142, column: 8, scope: !257)
!257 = distinct !DILexicalBlock(scope: !214, file: !3, line: 142, column: 7)
!258 = !DILocation(line: 142, column: 23, scope: !257)
!259 = !DILocation(line: 142, column: 26, scope: !257)
!260 = !{!238, !238, i64 0}
!261 = !DILocation(line: 142, column: 42, scope: !257)
!262 = !DILocation(line: 142, column: 7, scope: !214)
!263 = !DILocation(line: 144, column: 5, scope: !264)
!264 = distinct !DILexicalBlock(scope: !257, file: !3, line: 142, column: 48)
!265 = !DILocation(line: 145, column: 3, scope: !264)
!266 = !DILocation(line: 152, column: 6, scope: !214)
!267 = !DILocation(line: 153, column: 37, scope: !268)
!268 = distinct !DILexicalBlock(scope: !269, file: !3, line: 152, column: 14)
!269 = distinct !DILexicalBlock(scope: !214, file: !3, line: 152, column: 6)
!270 = !{!271, !238, i64 12}
