; ModuleID = 'buzz_lb_kern.c'
source_filename = "buzz_lb_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [4 x i32]*, [4 x i32]*, [4 x i32]*, [128 x i32]*, [1 x i32]* }
%struct.anon.4 = type { [20 x i32]*, i32*, i64*, [128 x i32]*, [1 x i32]* }
%struct.anon.5 = type { [20 x i32]*, i32*, i64*, [128 x i32]*, [1 x i32]* }
%struct.anon.6 = type { [2 x i32]*, i32*, i32*, [1 x i32]*, [1 x i32]* }
%struct.anon.7 = type { [2 x i32]*, i32*, i32*, [1 x i32]*, [1 x i32]* }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.S = type { i64 }
%struct.sk_reuseport_md = type { %union.anon, %union.anon.0, i32, i32, i32, i32, i32, %union.anon.1, %union.anon.2 }
%union.anon = type { i8* }
%union.anon.0 = type { i8* }
%union.anon.1 = type { %struct.bpf_sock* }
%struct.bpf_sock = type { i32, i32, i32, i32, i32, i32, i32, [4 x i32], i32, i16, i32, [4 x i32], i32, i32 }
%union.anon.2 = type { %struct.bpf_sock* }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon.3 }
%union.anon.3 = type { [4 x i32] }

@zero = dso_local constant i32 0, align 4, !dbg !0
@balancer_max = dso_local constant i32 128, align 4, !dbg !75
@buzz_lb_xdp.____fmt = internal constant [23 x i8] c"Heya! XDP buzzLB here!\00", align 1, !dbg !78

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !58, globals: !74, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "buzz_lb_kern.c", directory: "/media/aadhitya/DATA/XCodes/buzzLB/src", checksumkind: CSK_MD5, checksum: "43050237e601e4109b67833a021c1cf0")
!4 = !{!5, !14, !44, !48, !52}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 42776, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./vmlinux.h", directory: "/media/aadhitya/DATA/XCodes/buzzLB/src", checksumkind: CSK_MD5, checksum: "11eb692ee35903a9cd527ec4f7485b7b")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 11396, baseType: !7, size: 32, elements: !15)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!16 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!17 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!18 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!19 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!20 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!21 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!22 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!23 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!24 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!25 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!26 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!27 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!28 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!29 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!30 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!31 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!32 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!33 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!34 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!35 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!36 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!37 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!38 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!39 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!40 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!42 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!43 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sk_action", file: !6, line: 43317, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47}
!46 = !DIEnumerator(name: "SK_DROP", value: 0)
!47 = !DIEnumerator(name: "SK_PASS", value: 1)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bpf_hdr_start_off", file: !6, line: 122169, baseType: !7, size: 32, elements: !49)
!49 = !{!50, !51}
!50 = !DIEnumerator(name: "BPF_HDR_START_MAC", value: 0)
!51 = !DIEnumerator(name: "BPF_HDR_START_NET", value: 1)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 43553, baseType: !7, size: 32, elements: !53)
!53 = !{!54, !55, !56, !57}
!54 = !DIEnumerator(name: "BPF_ANY", value: 0)
!55 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!56 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!57 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!58 = !{!59, !60, !61, !7, !63, !65, !66, !70}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !6, line: 10, baseType: !62)
!62 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !6, line: 409, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !6, line: 12, baseType: !7)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 48, elements: !68)
!67 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!68 = !{!69}
!69 = !DISubrange(count: 6)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !72)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !6, line: 7174, baseType: !64)
!72 = !{!73}
!73 = !DISubrange(count: 4)
!74 = !{!0, !75, !78, !136, !141, !146, !148, !151, !169, !178, !198, !207, !218, !225, !230, !235, !244, !251, !256, !261, !266}
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "balancer_max", scope: !2, file: !3, line: 27, type: !77, isLocal: false, isDefinition: true)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "____fmt", scope: !80, file: !3, line: 150, type: !132, isLocal: true, isDefinition: true)
!80 = distinct !DISubprogram(name: "buzz_lb_xdp", scope: !3, file: !3, line: 146, type: !81, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !93)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !84}
!83 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 46155, size: 192, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !92}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !6, line: 46156, baseType: !64, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !85, file: !6, line: 46157, baseType: !64, size: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !85, file: !6, line: 46158, baseType: !64, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !85, file: !6, line: 46159, baseType: !64, size: 32, offset: 96)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !85, file: !6, line: 46160, baseType: !64, size: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !85, file: !6, line: 46161, baseType: !64, size: 32, offset: 160)
!93 = !{!94, !95, !96, !97, !102, !103, !111, !128}
!94 = !DILocalVariable(name: "ctx", arg: 1, scope: !80, file: !3, line: 146, type: !84)
!95 = !DILocalVariable(name: "data", scope: !80, file: !3, line: 147, type: !59)
!96 = !DILocalVariable(name: "data_end", scope: !80, file: !3, line: 148, type: !59)
!97 = !DILocalVariable(name: "trace", scope: !80, file: !3, line: 152, type: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S", file: !3, line: 93, size: 64, elements: !99)
!99 = !{!100}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !98, file: !3, line: 95, baseType: !101, size: 64)
!101 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!102 = !DILocalVariable(name: "ret", scope: !80, file: !3, line: 153, type: !83)
!103 = !DILocalVariable(name: "eth", scope: !80, file: !3, line: 159, type: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !6, line: 63925, size: 112, elements: !106)
!106 = !{!107, !108, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !105, file: !6, line: 63926, baseType: !66, size: 48)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !105, file: !6, line: 63927, baseType: !66, size: 48, offset: 48)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !105, file: !6, line: 63928, baseType: !110, size: 16, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !6, line: 7170, baseType: !61)
!111 = !DILocalVariable(name: "iph", scope: !80, file: !3, line: 166, type: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !6, line: 66181, size: 160, elements: !114)
!114 = !{!115, !117, !118, !119, !120, !121, !122, !123, !124, !126, !127}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !113, file: !6, line: 66182, baseType: !116, size: 4, flags: DIFlagBitField, extraData: i64 0)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !6, line: 8, baseType: !67)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !113, file: !6, line: 66183, baseType: !116, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !113, file: !6, line: 66184, baseType: !116, size: 8, offset: 8)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !113, file: !6, line: 66185, baseType: !110, size: 16, offset: 16)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !113, file: !6, line: 66186, baseType: !110, size: 16, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !113, file: !6, line: 66187, baseType: !110, size: 16, offset: 48)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !113, file: !6, line: 66188, baseType: !116, size: 8, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !113, file: !6, line: 66189, baseType: !116, size: 8, offset: 72)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !113, file: !6, line: 66190, baseType: !125, size: 16, offset: 80)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !6, line: 65086, baseType: !61)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !113, file: !6, line: 66191, baseType: !71, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !113, file: !6, line: 66192, baseType: !71, size: 32, offset: 128)
!128 = !DILocalVariable(name: "be", scope: !129, file: !3, line: 177, type: !131)
!129 = distinct !DILexicalBlock(scope: !130, file: !3, line: 176, column: 5)
!130 = distinct !DILexicalBlock(scope: !80, file: !3, line: 175, column: 9)
!131 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 184, elements: !134)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!134 = !{!135}
!135 = !DISubrange(count: 23)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "____fmt", scope: !80, file: !3, line: 157, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 240, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 30)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "____fmt", scope: !80, file: !3, line: 171, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 216, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 27)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "____fmt", scope: !80, file: !3, line: 173, type: !132, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 278, type: !150, isLocal: false, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 32, elements: !72)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "nonce", scope: !2, file: !3, line: 37, type: !153, isLocal: false, isDefinition: true)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 31, size: 320, elements: !154)
!154 = !{!155, !160, !162, !163, !168}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !153, file: !3, line: 32, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 2)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !153, file: !3, line: 33, baseType: !161, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !153, file: !3, line: 34, baseType: !161, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !153, file: !3, line: 35, baseType: !164, size: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 32, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 1)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pinning", scope: !153, file: !3, line: 36, baseType: !164, size: 64, offset: 256)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "size", scope: !2, file: !3, line: 45, type: !171, isLocal: false, isDefinition: true)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 39, size: 320, elements: !172)
!172 = !{!173, !174, !175, !176, !177}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !171, file: !3, line: 40, baseType: !156, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !171, file: !3, line: 41, baseType: !161, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !171, file: !3, line: 42, baseType: !161, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !171, file: !3, line: 43, baseType: !164, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pinning", scope: !171, file: !3, line: 44, baseType: !164, size: 64, offset: 256)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "tcp_balancing_targets", scope: !2, file: !3, line: 53, type: !180, isLocal: false, isDefinition: true)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 47, size: 320, elements: !181)
!181 = !{!182, !187, !188, !192, !197}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !180, file: !3, line: 48, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 640, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 20)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !180, file: !3, line: 49, baseType: !161, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !180, file: !3, line: 50, baseType: !189, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !6, line: 18, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !6, line: 16, baseType: !101)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !180, file: !3, line: 51, baseType: !193, size: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 4096, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pinning", scope: !180, file: !3, line: 52, baseType: !164, size: 64, offset: 256)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "udp_balancing_targets", scope: !2, file: !3, line: 61, type: !200, isLocal: false, isDefinition: true)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 55, size: 320, elements: !201)
!201 = !{!202, !203, !204, !205, !206}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !200, file: !3, line: 56, baseType: !183, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !200, file: !3, line: 57, baseType: !161, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !200, file: !3, line: 58, baseType: !189, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !200, file: !3, line: 59, baseType: !193, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pinning", scope: !200, file: !3, line: 60, baseType: !164, size: 64, offset: 256)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "perf_map", scope: !2, file: !3, line: 69, type: !209, isLocal: false, isDefinition: true)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 63, size: 320, elements: !210)
!210 = !{!211, !214, !215, !216, !217}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !209, file: !3, line: 64, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 128, elements: !72)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !209, file: !3, line: 65, baseType: !212, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !209, file: !3, line: 66, baseType: !212, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !209, file: !3, line: 67, baseType: !193, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pinning", scope: !209, file: !3, line: 68, baseType: !164, size: 64, offset: 256)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !220, line: 177, type: !221, isLocal: true, isDefinition: true)
!220 = !DIFile(filename: "./../libbpf/src/bpf_helper_defs.h", directory: "/media/aadhitya/DATA/XCodes/buzzLB/src", checksumkind: CSK_MD5, checksum: "2d210aba22162d34a56b8d1dc5e331a2")
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!60, !224, !64, null}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !220, line: 114, type: !227, isLocal: true, isDefinition: true)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!191}
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "bpf_perf_event_output", scope: !2, file: !220, line: 696, type: !232, isLocal: true, isDefinition: true)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!60, !59, !59, !191, !59, !191}
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !2, file: !220, line: 794, type: !237, isLocal: true, isDefinition: true)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!240, !242, !64, !242, !64, !243}
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !6, line: 14, baseType: !241)
!241 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !6, line: 7176, baseType: !64)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "bpf_skb_load_bytes_relative", scope: !2, file: !220, line: 1813, type: !246, isLocal: true, isDefinition: true)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!60, !249, !64, !59, !64, !64}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !220, line: 56, type: !253, isLocal: true, isDefinition: true)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!59, !59, !249}
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !220, line: 78, type: !258, isLocal: true, isDefinition: true)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!60, !59, !249, !249, !191}
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "bpf_get_prandom_u32", scope: !2, file: !220, line: 193, type: !263, isLocal: true, isDefinition: true)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!64}
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "bpf_sk_select_reuseport", scope: !2, file: !220, line: 2148, type: !268, isLocal: true, isDefinition: true)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!60, !271, !59, !59, !191}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_reuseport_md", file: !6, line: 46184, size: 448, elements: !273)
!273 = !{!274, !278, !282, !283, !284, !285, !286, !287, !310}
!274 = !DIDerivedType(tag: DW_TAG_member, scope: !272, file: !6, line: 46185, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !272, file: !6, line: 46185, size: 64, elements: !276)
!276 = !{!277}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !6, line: 46186, baseType: !59, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, scope: !272, file: !6, line: 46188, baseType: !279, size: 64, offset: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !272, file: !6, line: 46188, size: 64, elements: !280)
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !279, file: !6, line: 46189, baseType: !59, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !272, file: !6, line: 46191, baseType: !64, size: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "eth_protocol", scope: !272, file: !6, line: 46192, baseType: !64, size: 32, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ip_protocol", scope: !272, file: !6, line: 46193, baseType: !64, size: 32, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "bind_inany", scope: !272, file: !6, line: 46194, baseType: !64, size: 32, offset: 224)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !272, file: !6, line: 46195, baseType: !64, size: 32, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, scope: !272, file: !6, line: 46196, baseType: !288, size: 64, offset: 320)
!288 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !272, file: !6, line: 46196, size: 64, elements: !289)
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !288, file: !6, line: 46197, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !6, line: 46097, size: 640, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !303, !304, !305, !306, !307, !308}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !292, file: !6, line: 46098, baseType: !64, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !292, file: !6, line: 46099, baseType: !64, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !292, file: !6, line: 46100, baseType: !64, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !292, file: !6, line: 46101, baseType: !64, size: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !292, file: !6, line: 46102, baseType: !64, size: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !292, file: !6, line: 46103, baseType: !64, size: 32, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !292, file: !6, line: 46104, baseType: !64, size: 32, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !292, file: !6, line: 46105, baseType: !302, size: 128, offset: 224)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !72)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !292, file: !6, line: 46106, baseType: !64, size: 32, offset: 352)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !292, file: !6, line: 46107, baseType: !110, size: 16, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !292, file: !6, line: 46108, baseType: !64, size: 32, offset: 416)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !292, file: !6, line: 46109, baseType: !302, size: 128, offset: 448)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !292, file: !6, line: 46110, baseType: !64, size: 32, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !292, file: !6, line: 46111, baseType: !309, size: 32, offset: 608)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !6, line: 401, baseType: !83)
!310 = !DIDerivedType(tag: DW_TAG_member, scope: !272, file: !6, line: 46199, baseType: !311, size: 64, offset: 384)
!311 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !272, file: !6, line: 46199, size: 64, elements: !312)
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "migrating_sk", scope: !311, file: !6, line: 46200, baseType: !291, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !6, line: 66207, size: 320, elements: !315)
!315 = !{!316, !317, !318, !322, !323, !324, !325, !340}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !314, file: !6, line: 66208, baseType: !116, size: 4, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !314, file: !6, line: 66209, baseType: !116, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !314, file: !6, line: 66210, baseType: !319, size: 24, offset: 8)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 24, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 3)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !314, file: !6, line: 66211, baseType: !110, size: 16, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !314, file: !6, line: 66212, baseType: !116, size: 8, offset: 48)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !314, file: !6, line: 66213, baseType: !116, size: 8, offset: 56)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !314, file: !6, line: 66214, baseType: !326, size: 128, offset: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !6, line: 9641, size: 128, elements: !327)
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !326, file: !6, line: 9646, baseType: !329, size: 128)
!329 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !326, file: !6, line: 9642, size: 128, elements: !330)
!330 = !{!331, !335, !339}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !329, file: !6, line: 9643, baseType: !332, size: 128)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 128, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 16)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !329, file: !6, line: 9644, baseType: !336, size: 128)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 128, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 8)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !329, file: !6, line: 9645, baseType: !70, size: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !314, file: !6, line: 66215, baseType: !326, size: 128, offset: 192)
!341 = !{i32 7, !"Dwarf Version", i32 5}
!342 = !{i32 2, !"Debug Info Version", i32 3}
!343 = !{i32 1, !"wchar_size", i32 4}
!344 = !{i32 7, !"frame-pointer", i32 2}
!345 = !{!"Ubuntu clang version 14.0.0-1ubuntu1"}
!346 = !DILocation(line: 0, scope: !80)
!347 = !DILocation(line: 147, column: 37, scope: !80)
!348 = !{!349, !350, i64 0}
!349 = !{!"xdp_md", !350, i64 0, !350, i64 4, !350, i64 8, !350, i64 12, !350, i64 16, !350, i64 20}
!350 = !{!"int", !351, i64 0}
!351 = !{!"omnipotent char", !352, i64 0}
!352 = !{!"Simple C/C++ TBAA"}
!353 = !DILocation(line: 147, column: 26, scope: !80)
!354 = !DILocation(line: 147, column: 18, scope: !80)
!355 = !DILocation(line: 148, column: 41, scope: !80)
!356 = !{!349, !350, i64 4}
!357 = !DILocation(line: 148, column: 30, scope: !80)
!358 = !DILocation(line: 148, column: 22, scope: !80)
!359 = !DILocation(line: 150, column: 5, scope: !360)
!360 = distinct !DILexicalBlock(scope: !80, file: !3, line: 150, column: 5)
!361 = !DILocation(line: 152, column: 5, scope: !80)
!362 = !DILocation(line: 152, column: 14, scope: !80)
!363 = !DILocation(line: 154, column: 18, scope: !80)
!364 = !DILocation(line: 154, column: 11, scope: !80)
!365 = !DILocation(line: 154, column: 16, scope: !80)
!366 = !{!367, !368, i64 0}
!367 = !{!"S", !368, i64 0}
!368 = !{!"long long", !351, i64 0}
!369 = !DILocation(line: 155, column: 11, scope: !80)
!370 = !DILocation(line: 156, column: 9, scope: !371)
!371 = distinct !DILexicalBlock(scope: !80, file: !3, line: 156, column: 9)
!372 = !DILocation(line: 156, column: 9, scope: !80)
!373 = !DILocation(line: 157, column: 9, scope: !374)
!374 = distinct !DILexicalBlock(scope: !371, file: !3, line: 157, column: 9)
!375 = !DILocation(line: 157, column: 9, scope: !371)
!376 = !DILocation(line: 160, column: 14, scope: !377)
!377 = distinct !DILexicalBlock(scope: !80, file: !3, line: 160, column: 9)
!378 = !DILocation(line: 160, column: 38, scope: !377)
!379 = !DILocation(line: 160, column: 9, scope: !80)
!380 = !DILocation(line: 163, column: 9, scope: !381)
!381 = distinct !DILexicalBlock(scope: !80, file: !3, line: 163, column: 9)
!382 = !{!383, !384, i64 12}
!383 = !{!"ethhdr", !351, i64 0, !351, i64 6, !384, i64 12}
!384 = !{!"short", !351, i64 0}
!385 = !DILocation(line: 163, column: 33, scope: !381)
!386 = !DILocation(line: 163, column: 9, scope: !80)
!387 = !DILocation(line: 167, column: 38, scope: !388)
!388 = distinct !DILexicalBlock(scope: !80, file: !3, line: 167, column: 9)
!389 = !DILocation(line: 167, column: 61, scope: !388)
!390 = !DILocation(line: 167, column: 9, scope: !80)
!391 = !DILocation(line: 170, column: 14, scope: !392)
!392 = distinct !DILexicalBlock(scope: !80, file: !3, line: 170, column: 9)
!393 = !{!394, !351, i64 9}
!394 = !{!"iphdr", !351, i64 0, !351, i64 0, !351, i64 1, !384, i64 2, !384, i64 4, !384, i64 6, !351, i64 8, !351, i64 9, !384, i64 10, !350, i64 12, !350, i64 16}
!395 = !DILocation(line: 170, column: 23, scope: !392)
!396 = !DILocation(line: 170, column: 9, scope: !80)
!397 = !DILocation(line: 171, column: 9, scope: !398)
!398 = distinct !DILexicalBlock(scope: !392, file: !3, line: 171, column: 9)
!399 = !{!394, !350, i64 12}
!400 = !DILocation(line: 171, column: 9, scope: !392)
!401 = !DILocation(line: 173, column: 5, scope: !402)
!402 = distinct !DILexicalBlock(scope: !80, file: !3, line: 173, column: 5)
!403 = !DILocation(line: 175, column: 14, scope: !130)
!404 = !DILocation(line: 175, column: 20, scope: !130)
!405 = !DILocation(line: 175, column: 9, scope: !80)
!406 = !DILocation(line: 0, scope: !129)
!407 = !DILocation(line: 178, column: 13, scope: !408)
!408 = distinct !DILexicalBlock(scope: !129, file: !3, line: 178, column: 13)
!409 = !DILocation(line: 178, column: 32, scope: !408)
!410 = !DILocation(line: 178, column: 13, scope: !129)
!411 = !DILocation(line: 181, column: 22, scope: !129)
