; ModuleID = 'xdp_kern.c'
source_filename = "xdp_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }

@k = dso_local local_unnamed_addr global i32 2, align 4, !dbg !0
@bytes = dso_local local_unnamed_addr global [4 x i8] zeroinitializer, align 1, !dbg !61
@.str = private unnamed_addr constant [23 x i8] c"Heya! XDP buzzLB here!\00", align 1
@.str.1 = private unnamed_addr constant [19 x i8] c"Got non-TCP packet\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"Got TCP packet\00", align 1
@.str.3 = private unnamed_addr constant [14 x i8] c"Source IP: %u\00", align 1
@.str.4 = private unnamed_addr constant [14 x i8] c"Client IP: %u\00", align 1
@.str.5 = private unnamed_addr constant [41 x i8] c"Got packet from client, sending to BE %d\00", align 1
@.str.6 = private unnamed_addr constant [35 x i8] c"Source IP is not equal. Passing...\00", align 1
@.str.7 = private unnamed_addr constant [18 x i8] c"Passing packet...\00", align 1
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !55
@"llvm.ethhdr:0:5$0:0:5" = external global i64, !llvm.preserve.access.index !91 #0
@"llvm.ethhdr:0:12$0:2" = external global i64, !llvm.preserve.access.index !91 #0
@"llvm.iphdr:0:9$0:7" = external global i64, !llvm.preserve.access.index !97 #0
@"llvm.iphdr:0:12$0:9" = external global i64, !llvm.preserve.access.index !97 #0

!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 42776, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./vmlinux.h", directory: "/home/ubuntu/arkLB/src", checksumkind: CSK_MD5, checksum: "11eb692ee35903a9cd527ec4f7485b7b")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 11396, baseType: !7, size: 32, elements: !15)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!16 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!17 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!18 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!19 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!20 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!21 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!22 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!23 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!24 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!25 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!26 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!27 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!28 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!29 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!30 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!31 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!32 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!33 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!34 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!35 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!36 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!37 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!38 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!39 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!40 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!42 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!43 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!44 = !{!45, !46, !47, !49, !50}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !6, line: 10, baseType: !48)
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 48, elements: !52)
!51 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!52 = !{!53}
!53 = !DISubrange(count: 6)
!54 = !{!0, !55, !61, !64, !73, !80}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 107, type: !57, isLocal: false, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !59)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!59 = !{!60}
!60 = !DISubrange(count: 4)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "bytes", scope: !2, file: !3, line: 12, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 32, elements: !59)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !66, line: 177, type: !67, isLocal: true, isDefinition: true)
!66 = !DIFile(filename: "./../libbpf/src/bpf_helper_defs.h", directory: "/home/ubuntu/arkLB/src", checksumkind: CSK_MD5, checksum: "2d210aba22162d34a56b8d1dc5e331a2")
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!46, !70, !72, null}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !6, line: 12, baseType: !7)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !66, line: 114, type: !75, isLocal: true, isDefinition: true)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !6, line: 16, baseType: !79)
!79 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !2, file: !66, line: 794, type: !82, isLocal: true, isDefinition: true)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !87, !72, !87, !72, !89}
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !6, line: 14, baseType: !86)
!86 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !6, line: 7174, baseType: !72)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !6, line: 7176, baseType: !72)
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !6, line: 63925, size: 112, elements: !92)
!92 = !{!93, !94, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !91, file: !6, line: 63926, baseType: !50, size: 48)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !91, file: !6, line: 63927, baseType: !50, size: 48, offset: 48)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !91, file: !6, line: 63928, baseType: !96, size: 16, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !6, line: 7170, baseType: !47)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !6, line: 66181, size: 160, elements: !98)
!98 = !{!99, !101, !102, !103, !104, !105, !106, !107, !108, !110, !111}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !97, file: !6, line: 66182, baseType: !100, size: 4, flags: DIFlagBitField, extraData: i64 0)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !6, line: 8, baseType: !51)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !97, file: !6, line: 66183, baseType: !100, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !97, file: !6, line: 66184, baseType: !100, size: 8, offset: 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !97, file: !6, line: 66185, baseType: !96, size: 16, offset: 16)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !97, file: !6, line: 66186, baseType: !96, size: 16, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !97, file: !6, line: 66187, baseType: !96, size: 16, offset: 48)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !97, file: !6, line: 66188, baseType: !100, size: 8, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !97, file: !6, line: 66189, baseType: !100, size: 8, offset: 72)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !97, file: !6, line: 66190, baseType: !109, size: 16, offset: 80)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !6, line: 65086, baseType: !47)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !97, file: !6, line: 66191, baseType: !88, size: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !97, file: !6, line: 66192, baseType: !88, size: 32, offset: 128)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 46155, size: 192, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !112, file: !6, line: 46156, baseType: !72, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !112, file: !6, line: 46157, baseType: !72, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !112, file: !6, line: 46158, baseType: !72, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !112, file: !6, line: 46159, baseType: !72, size: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !112, file: !6, line: 46160, baseType: !72, size: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !112, file: !6, line: 46161, baseType: !72, size: 32, offset: 160)
!120 = !{i32 7, !"Dwarf Version", i32 5}
!121 = !{i32 2, !"Debug Info Version", i32 3}
!122 = !{i32 1, !"wchar_size", i32 4}
!123 = !{i32 7, !"frame-pointer", i32 2}
!124 = !{!"Ubuntu clang version 14.0.0-1ubuntu1"}
!125 = distinct !DISubprogram(name: "IP_ADDRESS", scope: !3, file: !3, line: 14, type: !126, scopeLine: 14, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !128)
!126 = !DISubroutineType(types: !127)
!127 = !{!7, !90, !90, !90, !90}
!128 = !{!129, !130, !131, !132, !133}
!129 = !DILocalVariable(name: "w", arg: 1, scope: !125, file: !3, line: 14, type: !90)
!130 = !DILocalVariable(name: "x", arg: 2, scope: !125, file: !3, line: 14, type: !90)
!131 = !DILocalVariable(name: "y", arg: 3, scope: !125, file: !3, line: 14, type: !90)
!132 = !DILocalVariable(name: "z", arg: 4, scope: !125, file: !3, line: 14, type: !90)
!133 = !DILocalVariable(name: "res", scope: !125, file: !3, line: 15, type: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !6, line: 25240, baseType: !7)
!135 = !DILocation(line: 0, scope: !125)
!136 = !DILocation(line: 15, column: 29, scope: !125)
!137 = !DILocation(line: 15, column: 43, scope: !125)
!138 = !DILocation(line: 15, column: 33, scope: !125)
!139 = !DILocation(line: 15, column: 53, scope: !125)
!140 = !DILocation(line: 15, column: 47, scope: !125)
!141 = !DILocation(line: 15, column: 57, scope: !125)
!142 = !DILocation(line: 16, column: 5, scope: !125)
!143 = distinct !DISubprogram(name: "print_ip", scope: !3, file: !3, line: 19, type: !144, scopeLine: 20, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !146)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !7}
!146 = !{!147}
!147 = !DILocalVariable(name: "ip", arg: 1, scope: !143, file: !3, line: 19, type: !7)
!148 = !DILocation(line: 0, scope: !143)
!149 = !DILocation(line: 21, column: 16, scope: !143)
!150 = !DILocation(line: 21, column: 14, scope: !143)
!151 = !{!152, !152, i64 0}
!152 = !{!"omnipotent char", !153, i64 0}
!153 = !{!"Simple C/C++ TBAA"}
!154 = !DILocation(line: 22, column: 20, scope: !143)
!155 = !DILocation(line: 22, column: 16, scope: !143)
!156 = !DILocation(line: 22, column: 14, scope: !143)
!157 = !DILocation(line: 23, column: 20, scope: !143)
!158 = !DILocation(line: 23, column: 16, scope: !143)
!159 = !DILocation(line: 23, column: 14, scope: !143)
!160 = !DILocation(line: 24, column: 20, scope: !143)
!161 = !DILocation(line: 24, column: 16, scope: !143)
!162 = !DILocation(line: 24, column: 14, scope: !143)
!163 = !DILocation(line: 26, column: 1, scope: !143)
!164 = distinct !DISubprogram(name: "buzz_lb_xdp", scope: !3, file: !3, line: 55, type: !165, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !168)
!165 = !DISubroutineType(types: !166)
!166 = !{!90, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!168 = !{!169, !170, !171, !172, !174, !176, !179}
!169 = !DILocalVariable(name: "ctx", arg: 1, scope: !164, file: !3, line: 55, type: !167)
!170 = !DILocalVariable(name: "data", scope: !164, file: !3, line: 56, type: !45)
!171 = !DILocalVariable(name: "data_end", scope: !164, file: !3, line: 57, type: !45)
!172 = !DILocalVariable(name: "eth", scope: !164, file: !3, line: 61, type: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!174 = !DILocalVariable(name: "iph", scope: !164, file: !3, line: 68, type: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!176 = !DILocalVariable(name: "ip", scope: !164, file: !3, line: 78, type: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !6, line: 1883, baseType: !178)
